# Parameter Property (BuiltInParameter) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyManager..::..Parameter Property (BuiltInParameter)
FamilyManager Class See Also
---
Obtains the parameter of this type with a given parameter id.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public FamilyParameter this[
	BuiltInParameter parameterId
] { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Parameter ( _
	parameterId As BuiltInParameter _
) As FamilyParameter
	Get
```

Visual C++
---
```text
public:
property FamilyParameter^ Parameter[BuiltInParameter parameterId] {
	FamilyParameter^ get (BuiltInParameter parameterId);
}
```

# ### Parameters
parameterId
    Type: Autodesk.Revit.DB..::..BuiltInParameter
# Remarks
Returns nullNothingnullptra null reference (Nothing in Visual Basic) if the parameter is not found.
# See Also
FamilyManager Class
Parameter Overload
Autodesk.Revit.DB Namespace